In [2]:
import pandas as pd
import numpy as np

In [3]:
ser2 = pd.Series(['a', 'b', 'c'], index=[2, 3, 4])
ser2

ser2.index

Int64Index([2, 3, 4], dtype='int64')

In [10]:
data = {'name': ['Goerge', 'Kevin', 'Michael', 'Jose'],
        'age': [35, 20, 26, 50],
        'height': [5.5, 4.9, 5.6, 5.4]}

df = pd.DataFrame(data)
df.head()

      name  age  height
0   Goerge   35     5.5
1    Kevin   20     4.9
2  Michael   26     5.6
3     Jose   50     5.4

In [13]:
data = {'name': ['George', 'Kevin', 'Michael', 'Jose'],
        'age': [35,20,26,50],
        'height': [5.5,4.9,5.6,5.4]} 
df2 = pd.DataFrame(data, index=range(1,len(data['name']) + 1))
new_df = df2.drop(index=[4])
new_df

      name  age  height
1   George   35     5.5
2    Kevin   20     4.9
3  Michael   26     5.6

In [38]:
df = pd.DataFrame([[4,2], [3,6]], columns=['A','B'])
print(df)

df2 = df.apply(lambda x : x*2)
cdf = df.apply(np.sum, axis=0)

df2 = df.apply(lambda x : print(x, "--"), raw=True, axis=0)

   A  B
0  4  2
1  3  6
[4 3] --
[2 6] --

In [47]:
df = pd.DataFrame([[4,2], [3,6]], columns=['A','B'])
df['C'] = df['A'].apply(lambda x : x ** 2)
df['B'] = df['B'].apply(lambda x : x - 2)
df

   A  B   C
0  4  0  16
1  3  4   9

In [51]:
obj = pd.Series(range(5), index = ['a','b','c','d','d'])
obj.index.is_unique

False